{
  "movies": [
    {
      "poster": "poster_a_start_is_born",
      "title": "A Star is Rising",
      "date": "3 Oktober 2018",
      "rating": 75,
      "runtime": 135,
      "budget": 504000000000,
      "revenue": 6074440000000,
      "overview": "Musisi kawakan, Jackson Maine, menemukan dan jatuh cinta dengan artis yang sedang berjuang, Ally. Dia baru saja menyerah pada mimpinya untuk menjadi besar sebagai penyanyi sampai Jack membujuknya menjadi sorotan. Tetapi bahkan ketika karir Ally lepas landas.\" , sisi pribadi dari hubungan mereka hancur, ketika Jack bertempur dalam pertempuran yang sedang berlangsung dengan setan internalnya sendiri."
    },
    {
      "poster": "poster_alita",
      "title": "Alita: Battle Angel",
      "date": "31 Januari 2019",
      "rating": 67,
      "runtime": 122,
      "budget": 2380000000000,
      "revenue": 5667940000000,
      "overview": "Ketika Alita terbangun tanpa ingatan tentang siapa dia di dunia masa depan yang tidak dia kenal, dia ditangkap oleh Ido, seorang dokter yang penuh kasih yang menyadari bahwa di suatu tempat dalam cangkang cyborg yang ditinggalkan ini adalah hati dan jiwa seorang wanita muda dengan luar biasa. lalu."
    },
    {
      "poster": "poster_aquaman",
      "title": "Aquaman",
      "date": "7 Desember 2018",
      "rating": 68,
      "runtime": 144,
      "budget": 2240000000000,
      "revenue": 16011600000000,
      "overview": "Dulunya merupakan rumah bagi peradaban paling maju di Bumi, Atlantis sekarang merupakan kerajaan bawah laut yang diperintah oleh Raja Orm yang haus kekuasaan. Dengan pasukan yang sangat besar, Orm berencana untuk menaklukkan orang-orang samudera yang tersisa dan kemudian ke permukaan dunia. Yang menghalangi jalannya adalah Arthur Curry, saudara tiri manusia setengah manusia Orm dan pewaris sejati takhta."
    },
    {
      "poster": "poster_bohemian",
      "title": "Bohemian Rhapsody",
      "date": "24 Oktober 2018",
      "rating": 81,
      "runtime": 135,
      "budget": 728000000000,
      "revenue": 11691900000000,
      "overview": "Penyanyi Freddie Mercury, gitaris Brian May, drummer Roger Taylor dan gitaris bass John Deacon mengambil dunia musik dengan badai ketika mereka membentuk band rock 'n' roll Queen pada tahun 1970. Lagu-lagu hit menjadi klasik instan. Ketika gaya hidup Mercury yang semakin liar mulai lepas kendali, Queen segera menghadapi tantangan terbesarnya namun menemukan cara untuk menjaga band bersama di tengah kesuksesan dan kelebihan."
    },
    {
      "poster": "poster_cold_persuit",
      "title": "Cold Pursuit",
      "date": "7 Februari 2019",
      "rating": 53,
      "runtime": 119,
      "budget": 840000000000,
      "revenue": 828995000000,
      "overview": "Kehidupan keluarga yang tenang di Nels Coxman, seorang sopir bajak salju, menjadi kacau setelah pembunuhan putranya. Nels memulai perburuan dendam untuk Viking, raja obat bius yang dianggapnya bertanggung jawab atas pembunuhan itu, menghilangkan rekan Viking satu per satu. Ketika Nels semakin dekat dengan Viking, tindakannya membawa konsekuensi yang lebih tak terduga dan keras, karena ia membuktikan bahwa balas dendam adalah semua dalam eksekusi."
    },
    {
      "poster": "poster_creed",
      "title": "Creed",
      "date": "15 November 2015",
      "rating": 73,
      "runtime": 133,
      "budget": 518000000000,
      "revenue": 2429950000000,
      "overview": "Mantan Juara Dunia Kelas Berat Rocky Balboa bertindak sebagai pelatih dan mentor bagi Adonis Johnson, putra almarhum teman dan mantan saingannya Apollo Creed."
    },
    {
      "poster": "poster_crimes",
      "title": "Fantastic Beasts: The Crimes of Grindelwald",
      "date": "14 November 2018",
      "rating": 69,
      "runtime": 134,
      "budget": 2800000000000,
      "revenue": 9146980000000,
      "overview": "Gellert Grindelwald telah lolos dari penjara dan mulai mengumpulkan pengikut untuk tujuan-nya - meninggikan penyihir di atas semua makhluk non-magis. Satu-satunya yang mampu menghentikannya adalah penyihir yang pernah ia sebut teman terdekatnya, Albus Dumbledore. Namun, Dumbledore perlu mencari bantuan dari penyihir yang pernah menggagalkan Grindelwald sebelumnya, mantan muridnya Newt Scamander, yang setuju untuk membantu, tidak menyadari bahaya yang ada di depan. Garis digambar saat cinta dan kesetiaan diuji, bahkan di antara teman dan keluarga yang paling sejati, di dunia sihir yang semakin terpecah."
    },
    {
      "poster": "poster_glass",
      "title": "Glass",
      "date": "16 Januari 2019",
      "rating": 65,
      "runtime": 129,
      "budget": 280000000000,
      "revenue": 3457190000000,
      "overview": "Tinjauan Umum: Dalam serangkaian pertemuan yang meningkat, mantan penjaga keamanan David Dunn menggunakan kemampuan supernaturalnya untuk melacak Kevin Wendell Crumb, seorang lelaki terganggu yang memiliki dua puluh empat kepribadian. Sementara itu, kehadiran bayangan Elia Price muncul sebagai seorang orkestra yang menyimpan rahasia penting bagi keduanya."
    },
    {
      "poster": "poster_how_to_train",
      "title": "How to Train Your Dragon -  The Hidden World",
      "date": "3 Januari 2019",
      "rating": 77,
      "runtime": 104,
      "budget": 1806000000000,
      "revenue": 7245380000000,
      "overview": "Ketika Hiccup memenuhi mimpinya untuk menciptakan utopia naga yang damai, penemuan Toothless dari pasangan yang liar dan sulit ditangkap menarik Night Fury pergi. Ketika bahaya meningkat di rumah dan Hiccups berkuasa sebagai kepala desa diuji, baik naga dan pengendara harus membuat keputusan yang mustahil untuk menyelamatkan jenis mereka."
    },
    {
      "poster": "poster_infinity_war",
      "title": "Avengers: Infinity War",
      "date": "25 April 2018",
      "rating": 83,
      "runtime": 149,
      "budget": 4200000000000,
      "revenue": 28647400000000,
      "overview": "Ketika Avengers dan sekutu mereka terus melindungi dunia dari ancaman yang terlalu besar untuk ditangani oleh satu pahlawan, bahaya baru telah muncul dari bayang-bayang kosmik: Thanos. Seorang lalim penghinaan intergalaksi, tujuannya adalah untuk mengumpulkan semua enam Batu Infinity, artefak kekuatan tak terbayangkan, dan menggunakannya untuk menimbulkan keinginannya yang terpelintir pada semua kenyataan. Segala yang Avengers telah perjuangkan telah mengarah ke saat ini - nasib Bumi dan keberadaannya sendiri tidak pernah lebih pasti."
    },
    {
      "poster": "poster_marry_queen",
      "title": "Mary Queen of Scots",
      "date": "7 Desember 2018",
      "rating": 66,
      "runtime": 124,
      "budget": 350000000000,
      "revenue": 529307000000,
      "overview": "Pada 1561, Mary Stuart, janda Raja Prancis, kembali ke Skotlandia, merebut kembali tahta yang sah dan mengancam masa depan Ratu Elizabeth I sebagai penguasa Inggris, karena ia memiliki klaim sah atas takhta Inggris. Pengkhianatan, pemberontakan, konspirasi, dan pilihan hidup mereka sendiri membahayakan Ratu. Mereka mengalami biaya kekuasaan yang pahit, sampai nasib tragis mereka akhirnya terpenuhi."
    },
    {
      "poster": "poster_master_z",
      "title": "Master Z: Ip Man Legacy",
      "date": "20 Desember 2018",
      "rating": 52,
      "runtime": 107,
      "budget": 0,
      "revenue": 0,
      "overview": "Setelah dikalahkan oleh Ip Man, Cheung Tin Chi berusaha untuk tetap low profile. Saat menjalankan bisnisnya, ia berkelahi dengan orang asing bernama Davidson, yang merupakan bos besar di belakang bar distrik. Tin Chi berjuang keras dengan Wing Chun dan mendapatkan rasa hormat."
    },
    {
      "poster": "poster_mortal_engines",
      "title": "Mortal Engines",
      "date": "27 November 2018",
      "rating": 60,
      "runtime": 129,
      "budget": 1400000000000,
      "revenue": 1459310000000,
      "overview": "Ribuan tahun di masa depan, kota-kota di Bumi menjelajah dunia dengan roda besar, saling melahap dalam perjuangan untuk sumber daya yang semakin berkurang. Di salah satu kota traksi besar ini, London tua, Tom Natsworthy mengalami perjumpaan tak terduga dengan seorang wanita muda misterius dari daerah terlantar yang akan mengubah jalan hidupnya selamanya."
    },
    {
      "poster": "poster_overlord",
      "title": "Overlord",
      "date": "1 November 2018",
      "rating": 66,
      "runtime": 122,
      "budget": 532000000000,
      "revenue": 583210000000,
      "overview": "Prancis, Juni 1944. Menjelang D-Day, beberapa pasukan terjun payung Amerika jatuh di belakang garis musuh setelah pesawat mereka jatuh ketika dalam misi untuk menghancurkan menara radio di sebuah desa kecil di dekat pantai Normandia. Setelah mencapai target mereka, pasukan terjun payung yang masih hidup menyadari bahwa, selain melawan pasukan Nazi yang berpatroli di desa, mereka juga harus bertarung melawan sesuatu yang lain."
    },
    {
      "poster": "poster_ralph",
      "title": "Ralph Breaks the Internet",
      "date": "20 November 2018",
      "rating": 72,
      "runtime": 112,
      "budget": 2450000000000,
      "revenue": 7409100000000,
      "overview": "Penjahat video game, Ralph dan rekan-rekannya yang tidak sesuai, Vanellope von Schweetz harus mengambil risiko dengan melakukan perjalanan ke World Wide Web untuk mencari bagian pengganti untuk menyelamatkan video game Vanellope, \"Sugar Rush.\" Di atas kepala mereka, Ralph dan Vanellope mengandalkan warga internet - netizen - untuk membantu menavigasi jalan mereka, termasuk seorang pengusaha bernama Yesss, yang merupakan algoritma kepala dan jantung dan jiwa dari situs pembuat tren BuzzzTube ."
    },
    {
      "poster": "poster_robin_hood",
      "title": "Robin Hood",
      "date": "20 November 2018",
      "rating": 58,
      "runtime": 116,
      "budget": 1400000000000,
      "revenue": 1025640000000,
      "overview": "Seorang pejuang perang yang keras dan komandan Moornya melakukan pemberontakan yang berani melawan mahkota Inggris yang korup."
    },
    {
      "poster": "poster_serenity",
      "title": "Serenity",
      "date": "24 Januari 2019",
      "rating": 51,
      "runtime": 106,
      "budget": 350000000000,
      "revenue": 119659000000,
      "overview": "Baker Dill adalah kapten kapal nelayan yang memimpin tur di daerah tropis yang tenang yang disebut Pulau Plymouth. Namun, kehidupannya yang tenang hancur, ketika mantan istrinya, Karen, melacaknya dengan permohonan bantuan yang putus asa."
    },
    {
      "poster": "poster_spiderman",
      "title": "Spider-Man: Into the Spider-Verse",
      "date": "6 Desember 2018",
      "rating": 84,
      "runtime": 117,
      "budget": 1260000000000,
      "revenue": 5256310000000,
      "overview": "Miles Morales menyulap hidupnya antara menjadi siswa sekolah menengah dan menjadi manusia laba-laba. Saat Wilson Kingpin \"Fisk menggunakan collider super"
    },
    {
      "poster": "poster_t34",
      "title": "T-34",
      "date": "27 Desember 2018",
      "rating": 49,
      "runtime": 117,
      "budget": 140000000000,
      "revenue": 0,
      "overview": "Pada tahun 1944, sekelompok tentara Rusia yang berani berhasil melarikan diri dari penawanan Jerman di tank T-34 legendaris yang setengah hancur. Itu adalah saat-saat keberanian yang tak terlupakan, pertarungan sengit, cinta yang tak terpatahkan, dan mukjizat legendaris."
    }
  ]
}
