{
  "tv_series": [
    {
      "poster": "poster_arrow",
      "title": "Arrow",
      "date": "10 Oktober 2012",
      "rating": 58,
      "runtime": 42,
      "num_of_episode": 23,
      "language": "English",
      "overview": "Playboy miliarder manja, Oliver Queen, hilang dan diduga tewas ketika kapal pesiarnya hilang di laut. Dia kembali lima tahun kemudian seorang pria yang berubah, bertekad untuk membersihkan kota sebagai main hakim sendiri bersenjatakan busur."
    },
    {
      "poster": "poster_doom_patrol",
      "title": "Doom Patrol",
      "date": "15 Februari 2019",
      "rating": 61,
      "runtime": 60,
      "num_of_episode": 15,
      "language": "English",
      "overview": "Dulunya merupakan rumah bagi peradaban paling maju di Bumi, Atlantis sekarang merupakan kerajaan bawah laut yang diperintah oleh Raja Orm yang haus kekuasaan. Dengan pasukan yang sangat besar, Orm berencana untuk menaklukkan orang-orang samudera yang tersisa dan kemudian ke permukaan dunia. Yang menghalangi jalannya adalah Arthur Curry, saudara tiri manusia setengah manusia Orm dan pewaris sejati takhta."
    },
    {
      "poster": "poster_dragon_ball",
      "title": "Dragon Ball",
      "date": "26 Februari 1986",
      "rating": 72,
      "runtime": 25,
      "num_of_episode": 153,
      "language": "Japanese",
      "overview": "Dahulu kala di pegunungan, seorang master pertempuran yang dikenal sebagai Gohan menemukan seorang bocah aneh yang ia beri nama Goku. Gohan membesarkannya dan melatih Goku dalam seni bela diri sampai dia mati. Bocah muda dan sangat kuat itu sendirian, tetapi mudah dikelola."
    },
    {
      "poster": "poster_fairytail",
      "title": "Fairy Tail",
      "date": "12 Oktober 2009",
      "rating": 64,
      "runtime": 25,
      "num_of_episode": 48,
      "language": "Japanese",
      "overview": "Lucy adalah seorang gadis berusia 17 tahun, yang ingin menjadi penyihir penuh. Suatu hari ketika mengunjungi Kota Harujion, dia bertemu Natsu, seorang pemuda yang mudah sakit karena segala jenis transportasi. Tapi Natsu bukan sembarang anak biasa, dia adalah anggota dari salah satu serikat penyihir paling terkenal di dunia: Fairy Tail."
    },
    {
      "poster": "poster_family_guy",
      "title": "Family Guy",
      "date": "31 Januari 1999",
      "rating": 65,
      "runtime": 22,
      "num_of_episode": 7,
      "language": "English",
      "overview": "Seri animasi animasi Freakin 'Sweet yang sakit, terpelintir, dan salah, menampilkan petualangan keluarga Griffin yang disfungsional. Peter yang kikuk dan Lois yang sudah lama menderita memiliki tiga anak. Stewie (bayi yang brilian tetapi sadis yang bertekad membunuh ibunya dan mengambil alih dunia), Meg (yang tertua, dan merupakan gadis yang paling tidak populer di kota) dan Chris (anak tengah, dia tidak terlalu cerdas tetapi memiliki hasrat untuk film ). Anggota terakhir keluarga itu adalah Brian - anjing yang bisa bicara dan lebih dari sekadar hewan peliharaan, ia menjaga Stewie, sementara menghirup Martinis dan memilah-milah masalah hidupnya sendiri."
    },
    {
      "poster": "poster_flash",
      "title": "The Flash",
      "date": "7 Oktober 2014",
      "rating": 67,
      "runtime": 44,
      "num_of_episode": 23,
      "language": "English",
      "overview": "Setelah akselerator partikel menyebabkan badai aneh, Penyelidik CSI Barry Allen disambar petir dan jatuh koma. Beberapa bulan kemudian dia terbangun dengan kekuatan kecepatan super, memberinya kemampuan untuk bergerak melalui Central City seperti malaikat penjaga yang tak terlihat. Meskipun awalnya senang dengan kekuatan barunya, Barry terkejut menemukan bahwa dia bukan satu-satunya \"manusia meta\" yang diciptakan setelah ledakan akselerator - dan tidak semua orang menggunakan kekuatan baru mereka untuk kebaikan. Barry bermitra dengan S.T.A.R. Lab dan mendedikasikan hidupnya untuk melindungi yang tidak bersalah."
    },
    {
      "poster": "poster_got",
      "title": "Game of Thrones",
      "date": "17 Oktober 2011",
      "rating": 81,
      "runtime": 60,
      "num_of_episode": 10,
      "language": "English",
      "overview": "Tujuh keluarga bangsawan berjuang untuk menguasai tanah mitos Westeros. Gesekan antara rumah-rumah mengarah ke perang skala penuh. Semua sementara kejahatan yang sangat kuno terbangun di utara terjauh. Di tengah-tengah perang, perintah militer yang diabaikan, Night's Watch, adalah yang berdiri di antara alam manusia dan kengerian es di luarnya."
    },
    {
      "poster": "poster_gotham",
      "title": "Gotham",
      "date": "22 September 2014",
      "rating": 68,
      "runtime": 60,
      "num_of_episode": 22,
      "language": "English",
      "overview": "Sebelum ada Batman, ada GOTHAM. Setiap orang tahu nama Komisaris Gordon. Dia adalah salah satu musuh terbesar dunia kejahatan, seorang pria yang reputasinya identik dengan hukum dan ketertiban. Tapi apa yang diketahui tentang kisah Gordon dan kenaikannya dari detektif pemula ke Komisaris Polisi? Apa yang diperlukan untuk menavigasi berbagai lapisan korupsi yang diam-diam memerintah Kota Gotham, tempat bertelurnya penjahat paling ikonik di dunia?"
    },
    {
      "poster": "poster_grey_anatomy",
      "title": "Grey's Anatomy",
      "date": "27 Maret 2005",
      "rating": 63,
      "runtime": 43,
      "num_of_episode": 9,
      "language": "English",
      "overview": "Ikuti kehidupan pribadi dan profesional sekelompok dokter di Rumah Sakit Gray Sloan Memorial di Seattle."
    },
    {
      "poster": "poster_hanna",
      "title": "Hanna",
      "date": "28 Maret 2019",
      "rating": 64,
      "runtime": 50,
      "num_of_episode": 10,
      "language": "English",
      "overview": "Drama yang menegangkan dan menjadi dewasa ini mengikuti perjalanan seorang gadis muda yang luar biasa ketika ia menghindari pengejaran tanpa henti dari seorang agen CIA yang tidak ada buku dan mencoba untuk menggali kebenaran di balik siapa dirinya. Berdasarkan film Joe Wright 2011."
    },
    {
      "poster": "poster_iron_fist",
      "title": "Marvel's Iron Fist",
      "date": "17 Maret 2017",
      "rating": 61,
      "runtime": 55,
      "num_of_episode": 23,
      "language": "English",
      "overview": "Danny Rand muncul kembali 15 tahun setelah dianggap mati. Sekarang, dengan kekuatan Iron Fist, ia berusaha untuk merebut kembali masa lalunya dan memenuhi takdirnya."
    },
    {
      "poster": "poster_naruto_shipudden",
      "title": "Naruto Shippuden",
      "date": "15 Februari 2007",
      "rating": 75,
      "runtime": 22,
      "num_of_episode": 23,
      "language": "Japanese",
      "overview": "Naruto Shippuuden adalah kelanjutan dari serial TV animasi asli Naruto. Kisah ini berkisah tentang Uzumaki Naruto yang lebih tua dan sedikit lebih matang dan upayanya untuk menyelamatkan temannya Uchiha Sasuke dari cengkeraman Shinobi seperti ular, Orochimaru. Setelah 2 setengah tahun, Naruto akhirnya kembali ke desanya Konoha, dan mulai mewujudkan ambisinya, meskipun itu tidak akan mudah, karena Ia telah mengumpulkan beberapa musuh (lebih berbahaya), seperti organisasi shinobi. ; Akatsuki."
    },
    {
      "poster": "poster_ncis",
      "title": "NCIS",
      "date": "23 September 2003",
      "rating": 67,
      "runtime": 45,
      "num_of_episode": 24,
      "language": "English",
      "overview": "Dari pembunuhan dan spionase hingga terorisme dan kapal selam curian, tim agen khusus menyelidiki kejahatan apa pun yang memiliki sedikit bukti yang terhubung dengan personel Angkatan Laut dan Korps Marinir, terlepas dari pangkat atau posisi."
    },
    {
      "poster": "poster_riverdale",
      "title": "Riverdale",
      "date": "26 Januari 2017",
      "rating": 69,
      "runtime": 45,
      "num_of_episode": 22,
      "language": "English",
      "overview": "Berada di masa kini, seri ini menawarkan pandangan yang berani dan subversif pada Archie, Betty, Veronica dan teman-teman mereka, menjelajahi surreality kehidupan kota kecil, kegelapan dan keanehan yang meluap-luap di bawah fasad Riverdale yang sehat."
    },
    {
      "poster": "poster_shameless",
      "title": "Shameless",
      "date": "9 Januari 2011",
      "rating": 78,
      "runtime": 60,
      "num_of_episode": 14,
      "language": "English",
      "overview": "Chicagoan Frank Gallagher adalah ayah tunggal yang bangga dari enam anak yang cerdas, rajin, mandiri, yang tanpanya ... mungkin lebih baik. Ketika Frank tidak di bar menghabiskan sedikit uang yang mereka miliki, dia pingsan di lantai. Tetapi anak-anak telah menemukan cara untuk tumbuh meskipun dia. Mereka mungkin tidak seperti keluarga yang Anda kenal, tetapi mereka tidak meminta maaf karena menjadi diri mereka yang sebenarnya."
    },
    {
      "poster": "poster_supergirl",
      "title": "Supergirl",
      "date": "26 Oktober 2015",
      "rating": 58,
      "runtime": 42,
      "num_of_episode": 22,
      "language": "English",
      "overview": "Kara Zor-El, 24 tahun, yang ditangkap oleh keluarga Danvers ketika dia berusia 13 tahun setelah diusir dari Krypton, harus belajar merangkul kekuatannya setelah sebelumnya menyembunyikannya. Danvers mengajarinya untuk berhati-hati dengan kekuatannya, sampai dia harus mengungkapkannya selama bencana yang tak terduga, menempatkannya dalam perjalanan kepahlawanannya."
    },
    {
      "poster": "poster_supernatural",
      "title": "Supernatural",
      "date": "20 November 2018",
      "rating": 73,
      "runtime": 45,
      "num_of_episode": 20,
      "language": "English",
      "overview": "Ketika mereka masih kecil, Sam dan Dean Winchester kehilangan ibu mereka karena kekuatan gaib yang misterius dan iblis. Selanjutnya, ayah mereka membesarkan mereka menjadi tentara. Dia mengajari mereka tentang kejahatan paranormal yang hidup di sudut-sudut gelap dan di jalan belakang Amerika ... dan dia mengajari mereka cara membunuhnya. Sekarang, saudara-saudara Winchester menjelajahi negara itu dengan Chevy Impala '67 mereka, memerangi setiap jenis ancaman supernatural yang mereka temui di sepanjang jalan."
    },
    {
      "poster": "poster_the_simpson",
      "title": "The Simpsons",
      "date": "17 Desember 1989",
      "rating": 71,
      "runtime": 22,
      "num_of_episode": 23,
      "language": "English",
      "overview": "Bertempat di Springfield, kota rata-rata di Amerika, pertunjukan ini berfokus pada kejenakaan dan petualangan sehari-hari keluarga Simpson; Homer, Marge, Bart, Lisa dan Maggie, serta ribuan pemain virtual. Sejak awal, serial ini telah menjadi ikon budaya pop, menarik ratusan selebriti menjadi bintang tamu. Acara ini juga menjadi terkenal karena satirnya yang tak kenal takut terhadap kehidupan politik, media, dan Amerika secara umum."
    },
    {
      "poster": "poster_the_umbrella",
      "title": "The Umbrella Academy",
      "date": "15 Februari 2019",
      "rating": 77,
      "runtime": 60,
      "num_of_episode": 10,
      "language": "English",
      "overview": "Keluarga pahlawan super yang disfungsional berkumpul untuk memecahkan misteri kematian ayah mereka, ancaman kiamat, dan banyak lagi."
    },
    {
      "poster": "poster_the_walking_dead",
      "title": "The Walking Dead",
      "date": "31 Oktober 2010",
      "rating": 73,
      "runtime": 60,
      "num_of_episode": 15,
      "language": "English",
      "overview": "Wakil Sheriff, Rick Grimes, terbangun dari koma untuk menemukan dunia pasca-apokaliptik yang didominasi oleh zombie pemakan daging. Dia berangkat untuk menemukan keluarganya dan bertemu banyak penyintas lainnya di sepanjang jalan."
    }
  ]
}